
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)  
	
	Запасы = Элементы.Найти("Запасы");
	ПодвалРазвернут = Элементы.Найти("ПодвалРазвернут");
	ГруппаКомментарий = Элементы.Найти("ГруппаКомментарий");
	
	
	ЭлементыФормы = Элементы.Добавить("Стоимость", Тип("ПолеФормы"), Запасы);
	ЭлементыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементыФормы.ПутьКДанным = "Объект.Запасы.Стоимость";
	
	ЭлементыФормы = Элементы.Вставить("ОбщаяСтоимостьСписания", Тип("ПолеФормы"), ПодвалРазвернут, ГруппаКомментарий);
	ЭлементыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементыФормы.ПутьКДанным = "Объект.ОбщаяСтоимостьСписания";
	
	
КонецПроцедуры

&НаСервере
Процедура Расш1_ПодсчетСтоимосиПослеНаСервере()
	
	Итог = 0;
	
	Для каждого СтрокаЗапасы из Объект.Запасы Цикл
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&День, ) КАК ЦеныНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ЗакупочнаяЦена КАК ЗакупочнаяЦена
		|		ПО ЦеныНоменклатуры.ВидЦен = ЗакупочнаяЦена.Значение
		|ГДЕ
		|	ЦеныНоменклатуры.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", СтрокаЗапасы.Номенклатура);
	Запрос.УстановитьПараметр("День", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	СтрокаЗапасы.Стоимость = ВыборкаДетальныеЗаписи.Цена * СтрокаЗапасы.Количество;  
	
	Итог = Итог + СтрокаЗапасы.Стоимость;
	
	КонецЦикла;

    Объект.ОбщаяСтоимостьСписания = Итог;
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПодсчетСтоимосиПосле(Элемент)
	Расш1_ПодсчетСтоимосиПослеНаСервере();
КонецПроцедуры


